artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 5
      arrivalRate: 20
      name: Warm up
    - duration: 10
      arrivalRate: 50
      rampTo: 100
      name: Ramp up load
    - duration: 20
      arrivalRate: 100
      name: Sustained load

before:
  flow:
    - log: "Get auth token"
    - post:
        url: "/login"
        json:
          name: admin
          login: admin
          password: admin
        capture:
          - json: $.token
            as: token
scenarios:
  - flow:
    - get:
        url: "/"
  - flow:
    - get:
        url: "/users"
        headers:
          authorization: "Bearer {{ token }}"